   ### Importing required libraries to work with postgreSQL and to perform exploratory data analysis

In [718]:
import psycopg2
import pandas as pd

### Creating a function for creating a database and setting connection without the need to run the whole code everytime in the future

In [719]:
def create_database():
    #connecting to default database 
    conn = psycopg2.connect('host = localhost dbname = postgres user = postgres password = root')
    #Commiting the transaction
    conn.set_session(autocommit = True)
    #creating cursor object to execute queries on database
    cur = conn.cursor()
    
    #First we drop any database that exists with same name and create a new database
    cur.execute("DROP DATABASE IF EXISTS project1")
    cur.execute("CREATE DATABASE project1")
    
    #Closing the connection
    conn.close()
    
    #connecting to the new database
    conn = psycopg2.connect('host = localhost dbname = project1 user = postgres password = root')
    cur = conn.cursor()
    
    return cur, conn

### Creating a function to drop tables from database

In [720]:
def drop_tables(cur,conn):
    for query in drop_table_queries:
        cur.execute(query)
        conn.commit()

### Creating a function to create tables in database

In [721]:
def create_tables(cur,conn):
    for query in create_table_queries:
        cur.execute(query)
        conn.commit()

### Reading csv file and assigning the dataframe to the variable

In [722]:
cities = pd.read_csv('Project1_dataset/cities.csv')

In [723]:
#displaying first five rows of the dataset 
cities.head()

   id            city
0   1        Tel Aviv
1   2       Ramat Gan
2   3  Ramat Hasharon
3   4        Herzelia
4   5       Givatayim

In [724]:
meal_types = pd.read_csv('Project1_dataset/meal_types.csv')

In [725]:
meal_types.head()

   id meal_type
0   1     Vegan
1   2    Cheese
2   3      Beef
3   4   Chicken

In [726]:
meals = pd.read_csv('Project1_dataset/meals.csv')

In [727]:
meals.head()

   id  restaurant_id  serve_type_id  meal_type_id hot_cold meal_name  price
0   1              1              1             2     Cold    Meal 1  43.22
1   2              1              2             4      Hot    Meal 2  29.22
2   3              1              3             1     Cold    Meal 3  37.34
3   4              1              3             2      Hot    Meal 4  52.41
4   5              1              3             2     Cold    Meal 5  27.75

In [728]:
members = pd.read_csv('Project1_dataset/members.csv')

In [729]:
members.head()

,id,first_name,surname,sex,email,city_id,monthly_budget
0,1,Ollie,Kinney,M,Ol.Kinney@walla.co.il,4,1000.0
1,2,Landon,Bishop,F,La.Bi@gmail.com,4,500.0
2,3,Jia,Delarosa,M,Jia.De@gmail.com,4,500.0
3,4,Valentina,Ratcliffe,F,Va.Ratcliffe@gmail.com,4,600.0
4,5,Stacie,Patel,F,St.Patel@hotmail.com,3,500.0

In [730]:
monthly_member_totals = pd.read_csv('Project1_dataset/monthly_member_totals.csv')

In [731]:
monthly_member_totals.head()

,member_id,first_name,surname,sex,email,city,year,month,order_count,meals_count,monthly_budget,total_expense,balance,commission
0,47,Joyce,Newton,F,Joyce.Ne@gmail.com,Herzelia,2020,1,17,37,1836.15,500.0,-1336.15,136.27950
1,126,Macey,Almond,M,Macey.Almond@yahoo.com,Tel Aviv,2020,1,30,64,2676.98,1000.0,-1676.98,214.98500
2,68,Aydin,Hirst,M,Aydin.Hirst@hotmail.com,Tel Aviv,2020,1,24,52,2286.53,1000.0,-1286.53,164.93850
3,193,Mira,Kent,M,Mi.Kent@walla.co.il,Tel Aviv,2020,1,24,54,2547.62,500.0,-2047.62,193.59125
4,53,Lilly-Ann,Frey,F,Li.Fr@hotmail.com,Tel Aviv,2020,1,23,50,2456.64,1000.0,-1456.64,193.97650

In [732]:
order_details = pd.read_csv('Project1_dataset/order_details.csv')

In [733]:
order_details.head()

   id  order_id  meal_id
0   1         3      176
1   2         5      349
2   3         5      348
3   4         5      344
4   5         5      348

In [734]:
orders = pd.read_csv('Project1_dataset/orders.csv')

In [735]:
orders.head()

   id        date              hour  member_id  restaurant_id  total_order
0   1  2020-01-01  11:00:00.0000000         25              6          0.0
1   2  2020-01-01  11:08:00.0000000        122              4          0.0
2   3  2020-01-01  11:10:00.0000000         62             16         39.0
3   4  2020-01-01  11:13:00.0000000        171              9          0.0
4   5  2020-01-01  11:13:00.0000000        152             30        153.0

In [736]:
restaurant_types = pd.read_csv('Project1_dataset/restaurant_types.csv')

In [737]:
restaurant_types.head()

   id restaurant_type
0   1       Fast Food
1   2           Asian
2   3         Italian
3   4        Homemade
4   5          Indian

In [738]:
restaurants = pd.read_csv('Project1_dataset/restaurants.csv')

In [739]:
restaurants.head()

   id restaurant_name  restaurant_type_id  income_persentage  city_id
0   1    Restaurant 1                   3              0.075        3
1   2    Restaurant 2                   5              0.100        3
2   3    Restaurant 3                   2              0.075        4
3   4    Restaurant 4                   4              0.100        4
4   5    Restaurant 5                   5              0.050        2

In [740]:
serve_types = pd.read_csv('Project1_dataset/serve_types.csv')

In [741]:
serve_types.head()

   id serve_type
0   1    Starter
1   2       Main
2   3     Desert

In [742]:
monthly_member_totals = monthly_member_totals.drop(['balance','commission'],axis = 1)

In [743]:
monthly_member_totals.head()

,member_id,first_name,surname,sex,email,city,year,month,order_count,meals_count,monthly_budget,total_expense
0,47,Joyce,Newton,F,Joyce.Ne@gmail.com,Herzelia,2020,1,17,37,1836.15,500.0
1,126,Macey,Almond,M,Macey.Almond@yahoo.com,Tel Aviv,2020,1,30,64,2676.98,1000.0
2,68,Aydin,Hirst,M,Aydin.Hirst@hotmail.com,Tel Aviv,2020,1,24,52,2286.53,1000.0
3,193,Mira,Kent,M,Mi.Kent@walla.co.il,Tel Aviv,2020,1,24,54,2547.62,500.0
4,53,Lilly-Ann,Frey,F,Li.Fr@hotmail.com,Tel Aviv,2020,1,23,50,2456.64,1000.0

### Calling the function to create database

In [744]:
cur, conn = create_database()

### Defining an SQL query to create a table and executing it using cursor object

In [745]:
#defining an sql query to create a table and assigning it to a variable
create_cities_table = ("""CREATE TABLE IF NOT EXISTS cities(
city_id int,
city varchar(100))""")

#using cursor object, we execute the query
cur.execute(create_cities_table)
#we commit the changes made to the database
conn.commit()

In [746]:
create_meal_types_table = ("""CREATE TABLE IF NOT EXISTS meal_types(
meal_type_id int,
meal_type varchar(100))""")

cur.execute(create_meal_types_table)
conn.commit()

In [747]:
create_meals_table = ("""CREATE TABLE IF NOT EXISTS meals(
meal_id int,
restaurant_id int,
serve_type_id int,
meal_type_id int,
hot_cold varchar(10),
meal_name varchar(10),
price float)""")

cur.execute(create_meals_table)
conn.commit()

In [748]:
create_members_table = ("""CREATE TABLE IF NOT EXISTS members(
member_id int,
first_name varchar(100),
surname varchar(100),
sex varchar(10),
email varchar(100),
city_id int,
monthly_budget float)""")

cur.execute(create_members_table)
conn.commit()

In [749]:
create_monthly_member_totals_table = ("""CREATE TABLE IF NOT EXISTS monthly_member_totals(
member_id int,
first_name varchar(100),
surname varchar(100),
sex varchar(10),
email varchar(100),
city varchar(100),
year int,
month int,
order_count int,
meals_count int,
monthly_budget float,
total_expense float)""")

cur.execute(create_monthly_member_totals_table)
conn.commit()

In [750]:
create_order_details_table = ("""CREATE TABLE IF NOT EXISTS order_details(
order_detail_id int,
order_id int,
meal_id int)""")

cur.execute(create_order_details_table)
conn.commit()

In [751]:
create_orders_table = ("""CREATE TABLE IF NOT EXISTS orders(
order_id int,
date date,
hour time,
member_id int,
restaurant_id int,
total_order float)""")

cur.execute(create_orders_table)
conn.commit()

In [752]:
create_restaurant_types_table = ("""CREATE TABLE IF NOT EXISTS restaurant_types(
restaurant_type__id int,
restaurant_type varchar(100))""")

cur.execute(create_restaurant_types_table)
conn.commit()

In [753]:
create_restaurants_table = ("""CREATE TABLE IF NOT EXISTS restaurants(
restaurant_id int,
restaurant_name varchar(100),
restaurant_type_id int,
income_percentage float,
city_id int)""")

cur.execute(create_restaurants_table)
conn.commit()

In [754]:
create_serve_types_table = ("""CREATE TABLE IF NOT EXISTS serve_types(
serve_type_id int,
serve_type varchar(100))""")

cur.execute(create_serve_types_table)
conn.commit()

### Defining an SQL query to insert data into a table

In [755]:
insert_cities_table = ("""INSERT INTO cities(
city_id,
city)
VALUES(%s, %s)""")

### Executing the query by looping through each row in the dataframe and inserting the row's values in the table

In [756]:
for i,row in cities.iterrows():
    cur.execute(insert_cities_table, list(row))
conn.commit()

In [757]:
insert_meal_types_table = ("""INSERT INTO meal_types(
meal_type_id,
meal_type)
VALUES(%s, %s)""")

In [758]:
for i,row in meal_types.iterrows():
    cur.execute(insert_meal_types_table, list(row))
conn.commit()

In [759]:
insert_meals_table = ("""INSERT INTO meals(
meal_id,
restaurant_id,
serve_type_id,
meal_type_id,
hot_cold,
meal_name,
price)
VALUES(%s, %s, %s, %s, %s, %s, %s)""")

In [760]:
for i,row in meals.iterrows():
    cur.execute(insert_meals_table, list(row))
conn.commit()

In [761]:
insert_members_table = ("""INSERT INTO members(
member_id,
first_name,
surname,
sex,
email,
city_id,
monthly_budget)
VALUES(%s, %s, %s, %s, %s, %s, %s)""")

In [762]:
for i,row in members.iterrows():
    cur.execute(insert_members_table, list(row))
conn.commit()

In [763]:
insert_monthly_member_totals_table = ("""INSERT INTO monthly_member_totals(
member_id,
first_name,
surname,
sex,
email,
city,
year,
month,
order_count,
meals_count,
monthly_budget,
total_expense)
VALUES(%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)""")

In [764]:
for i,row in monthly_member_totals.iterrows():
    cur.execute(insert_monthly_member_totals_table, list(row))
conn.commit()

In [765]:
insert_order_details_table = ("""INSERT INTO order_details(
order_detail_id,
order_id,
meal_id)
VALUES(%s, %s, %s)""")

In [766]:
for i,row in order_details.iterrows():
    cur.execute(insert_order_details_table, list(row))
conn.commit()

In [767]:
insert_orders_table = ("""INSERT INTO orders(
order_id,
date,
hour,
member_id,
restaurant_id,
total_order)
VALUES(%s, %s, %s, %s, %s, %s)""")

In [768]:
for i,row in orders.iterrows():
    cur.execute(insert_orders_table, list(row))
conn.commit()

In [769]:
insert_restaurant_types_table = ("""INSERT INTO restaurant_types(
restaurant_type__id,
restaurant_type)
VALUES(%s, %s)""")

In [770]:
for i,row in restaurant_types.iterrows():
    cur.execute(insert_restaurant_types_table, list(row))
conn.commit()

In [771]:
insert_restaurants_table = ("""INSERT INTO restaurants(
restaurant_id,
restaurant_name,
restaurant_type_id,
income_percentage,
city_id)
VALUES(%s, %s, %s, %s, %s)""")

In [772]:
for i,row in restaurants.iterrows():
    cur.execute(insert_restaurants_table, list(row))
conn.commit()

In [773]:
insert_serve_types_table = ("""INSERT INTO serve_types(
serve_type_id,
serve_type)
VALUES(%s, %s)""")

In [774]:
for i,row in serve_types.iterrows():
    cur.execute(insert_serve_types_table, list(row))
conn.commit()

###  Validating whether our data was inserted into the table using select statement

In [775]:
try:
    cur.execute("SELECT * FROM cities;")
except psycopg2.Error as e:
    print("Error: Selecting rows")
    print(e)
    
row = cur.fetchone()
while row:
    print(row)
    row = cur.fetchone()

(1, 'Tel Aviv')
(2, 'Ramat Gan')
(3, 'Ramat Hasharon')
(4, 'Herzelia')
(5, 'Givatayim')

In [776]:
try:
    cur.execute("SELECT * FROM restaurants;")
except psycopg2.Error as e:
    print("Error: Selecting rows")
    print(e)
    
row = cur.fetchone()
while row:
    print(row)
    row = cur.fetchone()

(1, 'Restaurant 1', 3, 0.075, 3)
(2, 'Restaurant 2', 5, 0.1, 3)
(3, 'Restaurant 3', 2, 0.075, 4)
(4, 'Restaurant 4', 4, 0.1, 4)
(5, 'Restaurant 5', 5, 0.05, 2)
(6, 'Restaurant 6', 1, 0.05, 2)
(7, 'Restaurant 7', 1, 0.1, 4)
(8, 'Restaurant 8', 2, 0.075, 5)
(9, 'Restaurant 9', 1, 0.075, 4)
(10, 'Restaurant 10', 4, 0.1, 2)
(11, 'Restaurant 11', 5, 0.075, 4)
(12, 'Restaurant 12', 5, 0.075, 3)
(13, 'Restaurant 13', 5, 0.075, 3)
(14, 'Restaurant 14', 1, 0.05, 3)
(15, 'Restaurant 15', 1, 0.1, 4)
(16, 'Restaurant 16', 1, 0.075, 3)
(17, 'Restaurant 17', 1, 0.05, 2)
(18, 'Restaurant 18', 3, 0.05, 3)
(19, 'Restaurant 19', 2, 0.1, 2)
(20, 'Restaurant 20', 1, 0.075, 2)
(21, 'Restaurant 21', 2, 0.05, 1)
(22, 'Restaurant 22', 1, 0.075, 5)
(23, 'Restaurant 23', 1, 0.1, 1)
(24, 'Restaurant 24', 3, 0.05, 1)
(25, 'Restaurant 25', 3, 0.1, 4)
(26, 'Restaurant 26', 2, 0.075, 1)
(27, 'Restaurant 27', 5, 0.1, 4)
(28, 'Restaurant 28', 2, 0.1, 1)
(29, 'Restaurant 29', 2, 0.05, 5)
(30, 'Restaurant 30', 4, 0.075, 1)

###### We can see that the data has been inserted into the tables successfully

### Finally we close the database connection

In [777]:
cur.close()
conn.close()

###### Hence I have completed the project which helped me to learn about connecting to the PostgreSQL database, creating databases and executing SQL  queries on the database using python.